waku.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>The Waku Network</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="https://cdn.simplecss.org/simple.min.css" />
<link rel="stylesheet" href="./css/custom.css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">The Waku Network</h1>
<p>
The Waku Network is a shared p2p messaging network that is open-access, useful for generalized messaging, privacy-preserving, scalable and accessible even to resource-restricted devices. Some of the most prominent features include:
</p>
<ol class="org-ol">
<li>DoS/spam protection with privacy-preserving Rate-Limiting Nullifiers.</li>
<li>Scalability by sharding traffic into 8 pubsub topics.</li>
<li>Automatic shard selection based on content topic.</li>
<li>Services for resource-restricted nodes, including historical message storage and retrieval, filtering, etc.</li>
</ol>
<div id="outline-container-org9469e2e" class="outline-2">
<h2 id="org9469e2e">Origin</h2>
<div class="outline-text-2" id="text-org9469e2e">
<p>
If you have been following Waku or Status, you are likely to be familiar with the origin of Waku. The Status mobile app was created to be a web3 super app, a portal to the Ethereum ecosystem that leverages the three original pillars: Ethereum for consensus, Swarm for storage and Whisper for communication.
</p>

<p>
The Status development team attempted to build Status with Whisper, but this protocol had fundamental limitations, especially for resource-restricted devices, such as mobile phones.
</p>

<p>
Waku was born as a successor of Whisper, learning from its flaws to provide a scalable peer-to-peer communication network fit for mobile and browsers.
</p>
</div>
</div>
<div id="outline-container-org3adad33" class="outline-2">
<h2 id="org3adad33">Challenges / desired properties</h2>
<div class="outline-text-2" id="text-org3adad33">
<p>
Waku aims to overcome the following challenges:
</p>

<p>
Generalised messaging: Waku aims to provide protocols and a network that enables the transfer of arbitrary payloads. While Waku was originally created for a chat application, Status, the aim is to be generalised enough to build any decentralised communication or signalling application on Waku.
</p>

<p>
Ephemeral messaging: Waku aims to solve the problem of real-time communication, which aims to provide fair latency to enable one or several users to exchange small data payloads. This is in contrast to IPFS or other decentralised storage systems, which provide a way to store large amounts of data at the expense of latency and responsiveness.
</p>

<p>
Censorship-resistance: Waku aims to provide a censorship-resistant solution where external actors cannot block users' access to the Waku infrastructure. But also for app developers to be able to build with a cannot do evil mindset where they do not have the key to the kingdom and the ability to deplatform their users.
</p>

<p>
Privacy-minded: To provide the ability for app developers to operate on a cannot do evil principle in terms of data and metadata collection of their users. This means that even if they wanted or were pressured to they, or any third party, could not collect metadata such as social graphs or activity patterns from their users.
</p>

<p>
Anonymity: Similarly to privacy, this is the ability for users to not link Personal Identifiable Information (PII) to their activity on the Waku network or application using the network. PII considered here are in regards to the network (IP address), blockchain (e.g. Ethereum address), and routing (message correlation).
</p>

<p>
Resource-restricted devices: as previously mentioned, when designing Waku, an effort is made to consider environments such as mobile and browser to enable developers to build DApps for these platforms and provide as many of the properties listed above as possible.
</p>

<p>
Scalability: Waku aims to support millions of users while maintaining the principles above; this needs to be thoughtfully designed and tested.
</p>

<p>
All the properties above mean that other problems need to be overcome when designing Waku:
</p>

<p>
DOS protection: ensuring that the network cannot be flooded with messages, leading users who have fewer resources to be booted off the network.
</p>

<p>
Network sustainability and incentivisation: How do we ensure enough resources in the network to enable devices such as browsers and mobile devices to access the network?
</p>

<p>
Decentralisation: Waku needs to be decentralised at several levels to enable those properties. How do we maintain a fair level of decentralisation to ensure those properties remain over time?
</p>
</div>
</div>
<div id="outline-container-org42d0fd2" class="outline-2">
<h2 id="org42d0fd2">The Waku Network</h2>
<div class="outline-text-2" id="text-org42d0fd2">
<p>
How does the Waku Network help deliver the properties above?
</p>

<p>
Let us review the different Waku protocols that are combined in the network and how they enable us to achieve this feat.
</p>
</div>
</div>
<div id="outline-container-org7ec24ac" class="outline-2">
<h2 id="org7ec24ac">Peer discovery</h2>
<div class="outline-text-2" id="text-org7ec24ac">
<p>
discv5, minor enhancements to ENR
</p>
</div>
</div>
<div id="outline-container-org14d65f6" class="outline-2">
<h2 id="org14d65f6">Message Routing - Gossipsub</h2>
<div class="outline-text-2" id="text-org14d65f6">
<p>
Similar to Ethereum consensus layer
</p>
</div>
</div>
<div id="outline-container-org360f6f3" class="outline-2">
<h2 id="org360f6f3">Message routing - sharding</h2>
</div>

<div id="outline-container-org3a776de" class="outline-2">
<h2 id="org3a776de">Message Routing - RLN Relay</h2>
</div>

<div id="outline-container-org9e595bf" class="outline-2">
<h2 id="org9e595bf">Servicing Mostly-offline and Resource-restricted Devices</h2>
<div class="outline-text-2" id="text-org9e595bf">
<p>
Light push
</p>
</div>
</div>
<div id="outline-container-org1ab2d40" class="outline-2">
<h2 id="org1ab2d40">The Waku Network's value proposition</h2>
</div>

<div id="outline-container-orga563751" class="outline-2">
<h2 id="orga563751">Are we blank yet?</h2>
</div>
</div>
<div id="postamble" class="status">
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 31.0.50 (<a href="https://orgmode.org">Org</a> mode 9.7.11)</p>
</div>
</body>
</html>
